SubscribeList={
    "2079997275":{ #月
        "572187870":False, #粉丝群
        "691450484":False, #Bot测试群
        "917074903":False, #带管理的测试群
        "812477441":False
    },
    "15688975":{   #浓
        "691450484":False, #Bot测试群
        "917074903":False, #带管理的测试群
        "811513412":False
    },
    "3536995619964982":{ #包菜
        "691450484":False, #Bot测试群
        "917074903":False, #带管理的测试群
        "643509006":False
    },
    "3546604476828579":{ #吸血鬼
        "691450484":False, #Bot测试群
        "917074903":False #带管理的测试群
    }
}

"""
{
"主播账号1":{
        "推送群1":BooleanAt全体,
        "推送群2":BooleanAt全体
    },
"主播账号2":{
        "推送群1":BooleanAt全体,
        "推送群2":BooleanAt全体
    }
}
"""