import datetime
import json
from random import shuffle, randint
import random
import os
import gyue.gyue.plugins.Gyue.handles.Models.GroupMsgModel as model
import gyue.gyue.plugins.Gyue.GlobalScope as gs
import gyue.gyue.plugins.Gyue.utils.fileOperation as fileopt

cardkey = 30004785

cards = ['圣杯1', '圣杯10', '圣杯2', '圣杯3', '圣杯4', '圣杯5', '圣杯6', '圣杯7', '圣杯8', '圣杯9', '圣杯侍者',
         '圣杯国王', '圣杯王后', '圣杯骑士', '宝剑1', '宝剑10', '宝剑2', '宝剑3', '宝剑4', '宝剑5', '宝剑6', '宝剑7',
         '宝剑8', '宝剑9', '宝剑侍者', '宝剑国王', '宝剑王后', '宝剑骑士', '权杖1', '权杖10', '权杖2', '权杖3', '权杖4',
         '权杖5', '权杖6', '权杖7', '权杖8', '权杖9', '权杖侍者', '权杖国王', '权杖王后', '权杖骑士', '钱币1', '钱币10',
         '钱币2', '钱币3', '钱币4', '钱币5', '钱币6', '钱币7', '钱币8', '钱币9', '钱币侍者', '钱币国王', '钱币王后',
         '钱币骑士', '愚者', '魔术师', '女教皇', '女皇', '皇帝', '教皇', '恋人', '战车', '力量', '隐士', '命运之轮',
         '正义', '吊人', '死神', '节制', '恶魔', '塔', '星星', '月亮', '太阳', '审判', '世界']

fd = os.path.dirname(__file__)

meaning={
    '愚者':["開端、自由、純真、獨創性、冒險、理想主義、自發性","魯莽、粗心、分心、幼稚、愚蠢、容易上當、陳舊、遲鈍"],
    '魔术师':["意志力、慾望、足智多謀、技能、能力、專注、表現","操縱、狡猾、詭計、浪費天賦、錯覺、欺騙"],
    '女教皇':["無意識、直覺、神秘、靈性、更高的力量、內在的聲音","被壓抑的直覺、隱藏的動機、膚淺、困惑、認知失調"],
    '女皇':["神聖的女性、性感、生育力、培育、創造力、美麗、豐富、自然","不安全、專橫、疏忽、窒息、缺乏成長、缺乏進步"],
    '皇帝':["穩定性、結構、保護、權威、控制、實用性、重點、紀律","暴君、霸道、死板、固執、缺乏紀律、魯莽"],
    '教皇':["傳統、社會群體、約定俗成、從眾、教育、知識、信仰","叛逆、非常規、不循規蹈矩、新方法、無知"],
    '恋人':["愛、工會、夥伴關係、關係、選擇、浪漫、平衡、團結","不和諧、不平衡、衝突、超脫、錯誤的選擇、優柔寡斷"],
    '战车':["成功、雄心、決心、意志力、控制力、自律、專注","有力、沒有方向、沒有控制、無力、侵略、障礙"],
    '力量':["勇氣、勇敢、自信、同情、自信、內在力量","自我懷疑、軟弱、低信心、不足、怯懦、強硬"],
    '隐士':["自我反省、內省、沉思、退縮、孤獨、尋找自我","孤獨、孤立、隱居、反社會、拒絕、回歸社會"],
    '命运之轮':["變化、週期、命運、決定性時刻、運氣、財富、突發事件","運氣不好、缺乏控制、執著於控制、不受歡迎的變化、延誤"],
    '正义':["正義、業力、後果、責任、法律、真相、誠實、正直、因果","不公正、報復、不誠實、腐敗、不誠實、不公平、逃避責任"],
    '吊人':["犧牲、等待、不確定、缺乏方向、視角、沉思","拖延、漠不關心、停滯不前、避免犧牲、冷漠"],
    '死神':["轉變、結局、改變、過渡、放手、釋放","害怕改變、重複消極的模式、抵制改變、停滯不前、腐朽"],
    '节制':["平衡、和平、耐心、適度、平靜、安寧、和諧、寧靜","不平衡、過度、極端、不和諧、魯莽、倉促"],
    '恶魔':["壓迫、成癮、痴迷、依賴、過度、無力、局限","獨立、自由、啟示、釋放、收回權力、收回控制"],
    '塔':["災難、破壞、劇變、創傷、突變、混亂","避免災難、延遲不可避免的、抵制變化"],
    '星星':["希望、靈感、積極性、信念、更新、治愈、復興","絕望、絕望、消極、缺乏信心、沮喪"],
    '月亮':["錯覺、直覺、不確定性、困惑、複雜性、秘密、無意識","恐懼、欺騙、焦慮、誤解、曲解、清晰、理解"],
    '太阳':["幸福、成功、樂觀、活力、喜悅、自信、真理","幸福受阻、過度熱情、悲觀、不切實際的期望、自負"],
    '审判':["自我評價、覺醒、更新、目的、反思、清算","自我懷疑、缺乏自我意識、未能吸取教訓、自我厭惡"],
    '世界':["完成、成就、成就感、歸屬感、整體性、和諧","缺乏封閉感、缺乏成就感、感覺不完整、空虛"],
    '权杖1':["靈感、創意火花、新建議、新激情、熱情、活力","延遲、阻礙、缺乏激情、缺乏活力、猶豫、創意阻礙"],
    '权杖10':["負擔、責任、義務、壓力、義務、精疲力竭、鬥爭","不下放、肩負太多責任、崩潰、崩潰"],
    '权杖2':["計劃、第一步、做出決定、留下舒適感、承擔風險","糟糕的計劃、過度分析、不採取行動、謹慎行事、規避風險"],
    '权杖3':["動力、信心、擴張、增長、遠見、展望","限制、局限、缺乏進展、障礙、延誤、挫折"],
    '权杖4':["社區、家庭、慶典、聚會、穩定、歸屬感","缺乏支持、不穩定、感覺不受歡迎、短暫、缺乏根源、家庭衝突缺"],
    '权杖5':["衝突、競爭、爭論、侵略、緊張、對手、自我衝突","衝突結束、合作、協議、休戰、和諧、和平、避免衝突"],
    '权杖6':["成功、勝利、獎勵、認可、讚美、讚譽、驕傲","失敗、缺乏認可、沒有獎勵、缺乏成就"],
    '权杖7':["保護自己、為自己挺身而出、保護領土","放棄、認輸、讓步、缺乏自信、投降"],
    '权杖8':["運動、速度、進步、快速決定、突然變化、興奮","等待、緩慢、混亂、延誤、失去動力、倉促、毫無準備"],
    '权杖9':["最後立場、堅持、毅力、韌性、接近成功、疲勞","頑固、僵硬、防禦、拒絕妥協、放棄"],
    '权杖侍者':["冒險、興奮、新鮮的想法、開朗、精力充沛、無所畏懼、外向","倉促、不耐煩、缺乏想法、發脾氣、懶惰、無聊、不可靠、心煩意亂"],
    '权杖国王':["領導力、遠見、大局、掌控、大膽的決定、大膽、樂觀","強勢、霸道、暴君、惡毒、無能為力、無效、軟弱的領導者"],
    '权杖王后':["自信、熱情、堅定、社交、有魅力、活潑、樂觀","苛求、報復心強、自信心不足、嫉妒、自私、喜怒無常、欺負人"],
    '权杖骑士':["勇敢、精力充沛、迷人、英雄、叛逆、脾氣暴躁、自由精神","傲慢、魯莽、不耐煩、缺乏自製力、被動、易變、專橫"],
    '圣杯1':["愛、新感覺、情感覺醒、創造力、靈性、直覺","冷漠、空虛、情緒失落、創造力受阻、感覺不被愛"],
    '圣杯10':["幸福、回家、滿足、情緒穩定、安全、家庭和諧","不愉快的家、分離、家庭衝突、不和諧、孤立"],
    '圣杯2':["團結、夥伴關係、吸引力、聯繫、緊密聯繫、聯合力量、相互尊重","分離、拒絕、分裂、不平衡、緊張、溝通不良、退縮"],
    '圣杯3':["友誼、社區、聚會、慶祝活動、團體活動、社交活動","八卦、醜聞、過度、孤立、孤獨、孤獨、不平衡的社會生活"],
    '圣杯4':["冷漠、沉思、感覺與世隔絕、憂鬱、無聊、不滿","清晰、意識、接受、選擇幸福、抑鬱、消極"],
    '圣杯5':["失落、悲傷、失望、哀悼、不滿","接受、繼續前進、尋找平靜、滿足、看到積極的一面"],
    '圣杯6':["懷舊、回憶、熟悉、治愈、安慰、多愁善感、愉悅","被困在、前進、離家、獨立"],
    '圣杯7':["選擇、尋找目標、幻想、白日夢、一廂情願、優柔寡斷","缺乏目標、混亂、混亂、轉移、分心、清晰、做出選擇"],
    '圣杯8':["放棄、走開、放手、尋找真相、留下","停滯、單調、接受較少、迴避、害怕改變、處於糟糕的境地"],
    '圣杯9':["願望成真、滿足、成功、成就、認可、快樂","不快樂、缺乏滿足感、失望、成績不佳、傲慢、勢利"],
    '圣杯侍者':["理想主義、敏感、夢想家、天真","情緒脆弱、不成熟、忽視內在小孩、逃避現實、不安全感"],
    '圣杯国王':["明智的、外交的、頭腦和心靈之間的平衡、忠誠的","不知所措、焦慮、冷漠、壓抑、孤僻、控制欲強、自私"],
    '圣杯王后':["同情、溫暖、善良、直覺、支持","不安全、給予太多、過於敏感、有需要的、脆弱、依賴"],
    '圣杯骑士':["理想主義者、迷人藝術的、優雅的、委婉的、外交的、調解人、談判者","失望、發脾氣、喜怒無常、混亂、避免衝突、虛榮"],
    '宝剑1':["清晰、突破、新想法、專注、遠見、力量、真理","混亂、溝通不暢、敵意、爭論、破壞"],
    '宝剑10':["毀滅、失敗、痛苦、崩潰、疲憊、死胡同、受害、背叛","生存、改善、治愈、經驗教訓、絕望、復發"],
    '宝剑2':["僵局、艱難抉擇、左右為難、否認、隱藏信息","優柔寡斷、猶豫、焦慮、沒有正確的選擇、真相大白"],
    '宝剑3':["心碎、分離、悲傷、不安、失落、創傷、眼淚","治愈、寬恕、恢復、和解、壓抑情緒"],
    '宝剑4':["休息、放鬆、和平、庇護、療養、自我保護、恢復活力","恢復、覺醒、重新進入世界、擺脫孤立、煩躁、倦怠"],
    '宝剑5':["爭論、糾紛、侵略、欺凌、恐嚇、衝突、敵意、壓力","和解、解決、妥協、報復、後悔、悔恨、減少損失"],
    '宝剑6':["繼續前進、離開、留下、距離、接受教訓","困在過去、重蹈覆轍、逃避問題、陷入困境"],
    '宝剑7':["謊言、詭計、策略、足智多謀、偷偷摸摸、狡猾","懺悔、良心、悔恨、惡意、真相"],
    '宝剑8':["被困、受限、受害、癱瘓、無助、無能為力、監禁","自由、釋放、控制、倖存者、恐懼、投降"],
    '宝剑9':["恐懼、焦慮、消極、崩潰、絕望、噩夢、孤立","康復、學習面對、尋求幫助、羞恥、內疚、心理問題"],
    '宝剑侍者':["好奇、詼諧、健談、善於交際、有靈感、警惕、警覺、思維敏捷","散漫、憤世嫉俗、諷刺、八卦、侮辱、粗魯、缺乏計劃"],
    '宝剑国王':["理性、權威、紀律、誠信、道德、嚴肅、高標準","非理性的、獨裁者、壓迫、控制性的、冷酷無情、不誠實的"],
    '宝剑王后':["誠實、獨立、有原則、公平、建設性批評、客觀、有洞察力","悲觀的、惡意的、操縱性的、苛刻的、苦澀的、殘忍的、欺騙的、無情的"],
    '宝剑骑士':["自信、直接、不耐煩、聰明、大膽、專注、完美主義者、雄心","粗魯、不圓滑、強硬、欺凌、好鬥、惡毒、無情、傲慢"],
    '钱币1':["新機會、資源、豐富、繁榮、安全、穩定、表現","錯失機會、稀缺、不足、不穩定、吝嗇、錯誤的投資"],
    '钱币10':["遺產、根源、家庭、祖先、繼承、意外之財、特權、富裕、穩定、傳統","家庭糾紛、破產、債務、轉瞬即逝的成功、金錢衝突、不穩定、打破傳統"],
    '钱币2':["平衡資源、適應、足智多謀、靈活性、拉伸資源","不平衡、無組織、不堪重負、凌亂、混亂、過度擴張"],
    '钱币3':["團隊合作、共同目標、協作、學徒、努力、集中精力","缺乏凝聚力、缺乏團隊合作、冷漠、動力不足、衝突、自我、競爭"],
    '钱币4':["佔有欲、不安全感、吝嗇、穩定、安全、財富、節儉、界限","慷慨、給予、消費、開放、財務不安全、魯莽消費"],
    '钱币5':["困難、損失、孤立、感覺被遺棄、逆境、鬥爭、失業、疏遠、恥辱","積極的改變、從損失中恢復、克服逆境、寬恕、感到受歡迎"],
    '钱币6':["慷慨、慈善、社區、物質幫助、支持、分享、給予和接受、感恩","權力動態、濫用慷慨、附帶禮物、不平等、敲詐勒索"],
    '钱币7':["收穫、獎勵、結果、成長、進步、毅力、耐心、計劃","未完成的工作、拖延、低努力、浪費、缺乏成長、挫折、急躁"],
    '钱币8':["技能、才能、質量、高標準、專業知識、掌握、承諾、奉獻、成就","缺乏素質、倉促工作、名聲不好、缺乏動力、平庸、懶惰、低技能"],
    '钱币9':["有回報的努力、成功、成就、獨立、休閒、物質保障、自給自足","被守衛、物質不穩定、不計後果"],
    '钱币侍者':["雄心、勤奮、目標導向、計劃者、好學、腳踏實地、忠誠、忠實、可靠","愚蠢的、不成熟的、懶惰的、成績不佳、拖延、錯失機會、糟糕前景"],
    '钱币国王':["豐富、繁榮、安全、雄心、善良、重男輕女、保護性、感性、可靠","貪婪、物質、浪費、糟糕的財務決策、賭徒、佔有欲"],
    '钱币王后':["慷慨、關懷、培育、居家、商業意識、實用、舒適、熱情、明智、豪華","自私、蓬頭垢面、嫉妒、缺乏安全感、貪婪、物質主義、淘金者、不寬容"],
    '钱币骑士':["實用、可靠、高效、堅忍、緩慢而穩定、勤奮、忠誠、耐心、保守","工作狂、懶惰、沉悶、無聊、不主動、廉價、不負責、賭徒、冒險投資"]
}


async def tarotMain(m: model.GroupMsgModel):
    decks: list[list] = cardshuffle(m.getUserid())
    cardIndex = readMsgCardIndex(m.getMsg())
    desc = []
    for i in cardIndex:
        directionDesc = ""
        if decks[i][1] == 0:
            directionDesc = "正位"
        else:
            directionDesc = "逆位"
        desc.append(f"{decks[i][0]}({directionDesc}):{meaning[decks[i][0]][decks[i][1]]}")
    retMsg = str.join("\n", desc)
    if len(cardIndex)==1:
        await m.sendGroupMessage(m.CQ.At(m.getUserid())+f"[塔罗牌抽牌仿真]"+m.CQ.Img(f"{gs.path_botImgTarotDir}/{decks[cardIndex[0]][0]}.jpg")+f"\n你抽到的牌为:\n{retMsg}",m.getGroupid())
    else:
        await m.sendGroupMessage(m.CQ.At(m.getUserid())+f"[塔罗牌抽牌仿真]"+f"\n你抽到的牌为:\n{retMsg}\n为防止刷屏 抽多张牌时将不提供图片",m.getGroupid())
def cardshuffle(uid:str) -> list[list]:
    res = []
    random.seed(int(datetime.datetime.now().timestamp() * int(uid) * cardkey))
    indices = random.sample(cards, 78)
    for i in indices:
        res.append([i, random.randint(0, 1)])
    res.reverse()
    return res


async def sendMsg(m: model.GroupMsgModel, msg):
    await m.sendGroupMessage(msg, m.getGroupid())


def readMsgCardIndex(s: str) -> list[int]:
    cardIndex_strArr = s[5:].split(" ")
    cardIndex_intArr = []
    for i in cardIndex_strArr:
        if (int(i)<1 or int(i)>78):
            return [65536]
        cardIndex_intArr.append(int(i)-1)
    return cardIndex_intArr


def mergeTarotData(path:str):
    tarotdesc:dict={}
    for i in cards:
        cardDesc=fileopt.readFile(f"{path}/{i}.txt")
        cardPosi=fileopt.readFile(f"{path}/{i}正位.txt")
        cardNega=fileopt.readFile(f"{path}/{i}逆位.txt")
        tarotdesc.update({i:{"desc":cardDesc,"positive":cardPosi,"negative":cardNega}})
    jsonStr=json.dumps(tarotdesc,ensure_ascii=False)
    print(jsonStr)
    a=open(f"{path}/desc.json",'w',encoding="utf8")
    a.write(jsonStr)
    a.close()



def testFunc():
    dPath="D:/Bot/GyueBot/Data/TarotDesc"
    mergeTarotData(dPath)

